poysh/hubble/src/st25r39/esp32/src/esp32_st25r.c
#include "esp32_st25r.h"
#include "common.h"
#include "st_utils.h"
#include "st_errno.h"


/* Hold current selected NFC device instance */
static BSP_NFCTAG_Device_t *Current = NULL;
/* Hold current protocol set */
static BSP_NFCTAG_Protocol_t *CurrentProtocol = NULL;

/* NFC T2 Read command */
static uint8_t  t2tReadReq[]    = { 0x30, 0x00 };                                                                                 /* T2T READ Block:0 */
/* NFC T2 Write command */
static uint8_t  t2tWriteReq[]    = { 0xA2, 0x00, 0x00, 0x00, 0x00, 0x00 };                                                                                 /* T2T READ Block:0 */
/* NFC T3 Check command */
static uint8_t  t3tCheckReq[]   =  { 0x06, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x01, 0x09, 0x00, 0x01, 0x80, 0x00 };   /* T3T Check/Read command */
/* NFC T3 Update command */
static uint8_t  t3tUpdateReq[]   = { 0x08, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x01, 0x09, 0x00, 0x01, 0x80, 0x00,
                                     0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};   /* T3T Update command */
/* NFC T4 Select Ndef App command */
static uint8_t  t4tSelectNdefApp[] = {0x00, 0xA4, 0x04, 0x00, 0x07, 0xD2, 0x76, 0x00, 0x00, 0x85, 0x01, 0x01, 0x00};
/* NFC T4 Select File command */
static uint8_t  t4tSelectFile[] = {0x00, 0xA4, 0x00, 0x0C, 0x02, 0x00, 0x01};
/* NFC T4 Write command */
static uint8_t  t4tWriteData[] = {0x00, 0xD6, 0x00, 0x00, 0x00};
/* NFC T4 Read Binary command */
/*                                              Offset     Length  */
static uint8_t  t4tReadBinary[] = {0x00, 0xB0, 0x00, 0x00, 0x00};

/* NFC T4 Success code */
static uint8_t t4Success[] = {0x90,0x00};

/****************** NFCA *****************************/
/* NFCA RX Buffer length in bytes */
#define BSP_NFCTAG_NFCA_RXBUF_LENGTH 0xFF
static uint8_t BSP_NFCTAG_ReadData_NfcA(uint8_t* buffer, uint32_t offset, uint32_t length);

/* NFCA callback when waiting for a for long latency tag response */
BSP_NFCTAG_WaitingCallback_t *BSP_NFCTAG_WaitingCb = NULL;

/* Sends a T4 command, and waits the response */
static ReturnCode t4tSendCommand(uint8_t* txBuf, uint16_t txLen, rfalIsoDepBufFormat* rxBuf, uint16_t* rxBufLen)
{

  ReturnCode           err = ERR_NONE;
  rfalIsoDepTxRxParam   isoDepTxRx;
  rfalIsoDepBufFormat     isoDepTxBuf;  /* ISO-DEP Tx buffer format (with header/prologue) */
  bool rxChaining = false;              /* Rx chaining flag                                */

  memcpy( isoDepTxBuf.inf, txBuf, txLen );

  isoDepTxRx.DID          = RFAL_ISODEP_NO_DID;
  isoDepTxRx.ourFSx       = RFAL_ISODEP_FSX_KEEP;
  isoDepTxRx.FSx          = Current->proto.isoDep.info.FSx;
  isoDepTxRx.dFWT         = Current->proto.isoDep.info.dFWT;
  isoDepTxRx.FWT          = Current->proto.isoDep.info.FWT;
  isoDepTxRx.txBuf        = &isoDepTxBuf;
  isoDepTxRx.txBufLen     = txLen;
  isoDepTxRx.isTxChaining = false;
  isoDepTxRx.rxBuf        = rxBuf;
  isoDepTxRx.rxLen        = rxBufLen;
  isoDepTxRx.isRxChaining = &rxChaining;

  /*******************************************************************************/
  /* Trigger a RFAL ISO-DEP Transceive                                           */
  err = rfalIsoDepStartTransceive( isoDepTxRx );
  if(err != ERR_NONE)
  {
    return err;
  }
  do{
    do {
      err = rfalIsoDepGetTransceiveStatus();
      rfalWorker();
      // user callback when timeout is too long!
      if(BSP_NFCTAG_WaitingCb != NULL)
      {
        if(!BSP_NFCTAG_WaitingCb())
          return err;
      }
    } while(err == ERR_BUSY);
  } while ((err == ERR_NONE) && *isoDepTxRx.isRxChaining);
  return err;
}

/**
  * @brief Selects the T4 tag file based on its fileId.
  * @param fileId Id of the file to be selected
  * @returns the command status, 0 is a success, other values are errors
  */
uint8_t BSP_NFCTAG_T4_SelectFile(uint16_t fileId)
{
    ReturnCode           err = ERR_NONE;
    rfalIsoDepBufFormat rxBuf;
    uint16_t rxBufLen = sizeof(rxBuf);

    t4tSelectFile[5] = fileId >> 8;
    t4tSelectFile[6] = fileId & 0xFF;
    err = t4tSendCommand(t4tSelectFile, sizeof(t4tSelectFile), &rxBuf, &rxBufLen);
    if( (err != ERR_NONE) || (rxBuf.inf[0] != 0x90) || (rxBuf.inf[1] != 0x00))
    {
        return NFCTAG_ERROR;
    }

  return NFCTAG_OK;
}

/* NFCA Tag activation stage (Select Tag and NDEF file) */
static uint8_t BSP_NFCTAG_Activate_NfcA(void)
{
    ReturnCode           err = ERR_NONE;
    rfalNfcaSensRes      sensRes;
    rfalNfcaSelRes       selRes;
    rfalIsoDepBufFormat rxBuf;
    uint16_t rxBufLen = sizeof(rxBuf);
    uint16_t ndefFileId;

    if(Current->type != BSP_NFCTAG_NFCA)
    {
      return NFCTAG_ERROR;
    }

    // By default: claim that Ndef is not supported
    Current->NdefSupport = 0;

    rfalFieldOnAndStartGT();                                                          /* Turns the Field On and starts GT timer */
    rfalNfcaPollerInitialize();
    err = rfalNfcaPollerCheckPresence( RFAL_14443A_SHORTFRAME_CMD_WUPA, &sensRes ); /* Wake up all cards  */
    if(err != ERR_NONE)
    {
      return NFCTAG_ERROR;
    }

    if(Current->dev.nfca.type != RFAL_NFCA_T1T) {
      err = rfalNfcaPollerSelect( Current->dev.nfca.nfcId1, Current->dev.nfca.nfcId1Len, &selRes ); /* Select specific device  */
      if(err != ERR_NONE)
      {
        return NFCTAG_ERROR;
      }
    } else {
      rfalT1TPollerInitialize();
      // Ndef are supported
      Current->NdefSupport = 1;
    }

    if( Current->dev.nfca.type == RFAL_NFCA_T4T)
    {
    /*******************************************************************************/
        rfalIsoDepInitialize();

        /* Perform ISO-DEP (ISO14443-4) activation: RATS and PPS if supported */
        err = rfalIsoDepPollAHandleActivation( (rfalIsoDepFSxI)RFAL_ISODEP_FSDI_DEFAULT, RFAL_ISODEP_NO_DID,  RFAL_BR_848 /* RFAL_BR_424 RFAL_BR_106 */, &Current->proto.isoDep );
        if( err != ERR_NONE )
        {
            return NFCTAG_ERROR;
        }
        err = t4tSendCommand(t4tSelectNdefApp, sizeof(t4tSelectNdefApp), &rxBuf, &rxBufLen);
        if( err != ERR_NONE )
        {
            return NFCTAG_ERROR;
        }
        if(memcmp(t4Success,rxBuf.inf, sizeof(t4Success)))
        {
            return NFCTAG_RESPONSE_ERROR;
        }

        // get NDEF file Id from CCfile
        BSP_NFCTAG_T4_SelectFile(0xE103);
        BSP_NFCTAG_ReadData_NfcA((uint8_t*)&ndefFileId,9,2);
        ndefFileId = (ndefFileId >> 8) | ((ndefFileId & 0xFF) << 8) ;
        err = BSP_NFCTAG_T4_SelectFile(ndefFileId);
        if( err != ERR_NONE )
        {
            return NFCTAG_ERROR;
        }
        // Ndef are supported
        Current->NdefSupport = 1;
    }
   return NFCTAG_OK;
}

