poysh/hubble/src/st25r39/esp32/src/esp32_st25r.c
/* NFCA Tag read data method */
static uint8_t BSP_NFCTAG_ReadData_NfcA(uint8_t* buffer, uint32_t offset, uint32_t length)
{
    uint8_t rxBuf[RFAL_ISODEP_DEFAULT_FSC + RFAL_ISODEP_PROLOGUE_SIZE];
    uint16_t rxBufLen = 0xF0;
    uint8_t err;
    // read bytes
    uint16_t rxLen = rxBufLen;

    uint16_t readBytes = 0;
    uint16_t currentOffset = offset;
    uint16_t currentLength = length;
    while (currentLength > 0)
    {

      switch( Current->dev.nfca.type )
      {
          /*******************************************************************************/
          case RFAL_NFCA_T1T:
              /* To perform presence check, on this example a T1T Read command is used */
              err = rfalT1TPollerRall(Current->dev.nfca.nfcId1, rxBuf, rxBufLen,&rxLen );
              if((rxLen < (length + currentOffset)) || (rxLen < 2))
              {
                // Read all read less than expected length
                // could be because of rxBufLen < tag length
                return NFCTAG_ERROR;
              }
              rxLen = length;
              memcpy(buffer,&rxBuf[currentOffset],length);
              break;

          /*******************************************************************************/
          case RFAL_NFCA_T2T:
              // 4 bytes blocks
              t2tReadReq[1] = currentOffset / 4;
              /* To perform presence check, on this example a T2T Read command is used */
              err = rfalTransceiveBlockingTxRx( t2tReadReq, sizeof(t2tReadReq), rxBuf, rxBufLen, &rxLen, RFAL_TXRX_FLAGS_DEFAULT, rfalConvMsTo1fc(20) );
              rxLen -= currentOffset%4;
              if(rxLen > currentLength)
                rxLen = currentLength;
              memcpy(buffer + readBytes,&rxBuf[currentOffset%4],rxLen);
              break;

          /*******************************************************************************/
          case RFAL_NFCA_T4T:
              t4tReadBinary[2] = (currentOffset) >> 8;
              t4tReadBinary[3] = (currentOffset) & 0xFF;
              t4tReadBinary[4] = (currentLength) > rxBufLen ? rxBufLen : (currentLength);

              err = t4tSendCommand(t4tReadBinary, sizeof(t4tReadBinary), (rfalIsoDepBufFormat*)&rxBuf, &rxLen);
              if(rxLen > 2)
              {
                rxLen -= 2; // status bytes
                if(rxLen > currentLength)
                  rxLen = currentLength;
                memcpy(buffer + readBytes,&((rfalIsoDepBufFormat*)rxBuf)->inf[0],rxLen);
              } else {
                rxLen = 0;
              }
              break;
          default:
              return NFCTAG_ERROR;
      }
      if(( err != ERR_NONE ) || (rxLen == 0 ))
      {
        return NFCTAG_ERROR;
      } else {
        currentOffset += rxLen;
        currentLength -= rxLen;
        readBytes += rxLen;
      }
    } // while (currentLength > 0)
    return NFCTAG_OK;
}

/* NFCA Tag write data method */
uint8_t BSP_NFCTAG_WriteData_NfcA(uint8_t* buffer, uint32_t offset, uint32_t length)
{
    uint8_t rxBuf[RFAL_ISODEP_DEFAULT_FSC + RFAL_ISODEP_PROLOGUE_SIZE];
    uint16_t rxLen = 0xF0;
    uint8_t status = 0xFF;
    uint16_t currentOffset = offset;
    uint16_t lastOffset = offset + length;
    uint16_t nbBytesToWrite = length;
    uint8_t cmd[256 + 5 + 10];
    uint8_t nbBytesWritten = 0;
    uint8_t block[10] = {0};

    while (currentOffset < lastOffset)
    {

      switch( Current->dev.nfca.type )
      {
          /*******************************************************************************/
          case RFAL_NFCA_T1T:
              // -2 as H0 & H1 are not considered for block id
              status = rfalT1TPollerWrite( Current->dev.nfca.nfcId1,  currentOffset -2,  *buffer );
              if(status != ERR_NONE)
                return NFCTAG_ERROR;
              currentOffset ++;
              buffer++;
              break;

          /*******************************************************************************/
          case RFAL_NFCA_T2T:
                {
                  /* Manage offset and length for block based memories */
                  uint8_t blockInternalOffset = currentOffset % 4;
                  uint8_t blockInternalLength = 4 - (currentOffset % 4);
                  blockInternalLength = blockInternalLength > nbBytesToWrite ? nbBytesToWrite : blockInternalLength;

                  if((blockInternalOffset) || (blockInternalLength%4))
                  {
                    // 4 bytes block
                    t2tReadReq[1] = currentOffset / 4;
                    status = rfalTransceiveBlockingTxRx( t2tReadReq, sizeof(t2tReadReq), block, 0xF0, &rxLen, RFAL_TXRX_FLAGS_DEFAULT, rfalConvMsTo1fc(20) );
                    if(status != ERR_NONE)
                    {
                      return NFCTAG_ERROR;
                    }
                    // remove first byte (tag status)
                    memcpy(&block[blockInternalOffset],buffer,blockInternalLength);
                    buffer += blockInternalLength;
                    nbBytesWritten = blockInternalLength;

                  } else {
                    memcpy(block, buffer, 4);
                    buffer += 4;
                    nbBytesWritten = 4;
                  }

                  t2tWriteReq[1] = currentOffset/4;
                  memcpy(&t2tWriteReq[2], block, 4);
                  status = rfalTransceiveBlockingTxRx( t2tWriteReq, sizeof(t2tWriteReq), rxBuf, 0xF0, &rxLen, RFAL_TXRX_FLAGS_DEFAULT, rfalConvMsTo1fc(20) );
                  if(status >= ERR_INCOMPLETE_BYTE)
                    status = ERR_NONE;
                  if(status != ERR_NONE)
                    return NFCTAG_ERROR;
                  currentOffset +=nbBytesWritten;
                }
              break;

          /*******************************************************************************/
          case RFAL_NFCA_T4T:
            memcpy(cmd,t4tWriteData,sizeof(t4tWriteData));
            cmd[2] = offset >> 8;
            cmd[3] = offset & 0xFF;
            cmd[4] = length;
            memcpy(&cmd[5], buffer, length);
            status = t4tSendCommand(cmd, sizeof(t4tWriteData) + length, (rfalIsoDepBufFormat*)&rxBuf, &rxLen);
            currentOffset +=length;
            if(memcmp(&rxBuf[1],t4Success,sizeof(t4Success)))
            {
              // not a success code
               return NFCTAG_ERROR;
            }
            break;
          default:
          	break;
      }
    }

  if(status == ERR_NONE)
    return NFCTAG_OK;
  else
    return NFCTAG_ERROR;
}

/* NFCA Api */
static BSP_NFCTAG_Protocol_t apiNfcA = {
.activate = &BSP_NFCTAG_Activate_NfcA,
.read_data= &BSP_NFCTAG_ReadData_NfcA,
.write_data= &BSP_NFCTAG_WriteData_NfcA
};

/****************** NFCB *****************************/
/* NFCB Tag activation (Select tag & NDEF file) */
static uint8_t BSP_NFCTAG_Activate_NfcB(void)
{
  uint8_t err;
  rfalNfcbSensbRes     sensbRes;
  uint8_t              sensbResLen;

