poysh/hubble/src/st25r39/esp32/src/esp32_st25r.c
  Current->NdefSupport = 0;

  rfalFieldOnAndStartGT();    /* Turns the Field On and starts GT timer */
  if(Current->type == BSP_NFCTAG_ST25TB)
  {
    rfalSt25tbPollerInitialize();
    rfalFieldOnAndStartGT();

    err = rfalSt25tbPollerCheckPresence(&Current->dev.st25tb.chipID);
    if(err != ERR_NONE)
    {
      return NFCTAG_ERROR;
    }
    err = rfalSt25tbPollerSelect(Current->dev.st25tb.chipID);
    if(err != ERR_NONE)
    {
      return NFCTAG_ERROR;
    }

  }
  if(Current->type == BSP_NFCTAG_NFCB)
  {
    rfalIsoDepBufFormat rxBuf;
    uint16_t rxBufLen = sizeof(rxBuf);
    rfalNfcbPollerInitialize();

    err = rfalNfcbPollerCheckPresence( RFAL_NFCB_SENS_CMD_ALLB_REQ, RFAL_NFCB_SLOT_NUM_1, &sensbRes, &sensbResLen );
    if( err != ERR_NONE )
    {
      return NFCTAG_ERROR;
    }

    rfalIsoDepInitialize();
    err = rfalIsoDepPollBHandleActivation( (rfalIsoDepFSxI)RFAL_ISODEP_FSDI_DEFAULT, RFAL_ISODEP_NO_DID, RFAL_BR_424, 0x00, &Current->dev.nfcb, NULL, 0, &Current->proto.isoDep );
    if( err != ERR_NONE )
    {
      return NFCTAG_ERROR;
    }
    err = t4tSendCommand(t4tSelectNdefApp, sizeof(t4tSelectNdefApp), &rxBuf, &rxBufLen);
    if( err != ERR_NONE )
    {
        return NFCTAG_ERROR;
    }

    err = BSP_NFCTAG_T4_SelectFile(0x0001);
    if( err != ERR_NONE )
    {
        return NFCTAG_ERROR;
    }
    Current->NdefSupport = 1;
  }
  return NFCTAG_OK;
}

/* NFCB Tag read data method */
static uint8_t BSP_NFCTAG_ReadData_NfcB(uint8_t* buffer, uint32_t offset, uint32_t length)
{
  uint8_t err;
  uint8_t rxBuf[4];
  if(Current->type == BSP_NFCTAG_ST25TB)
  {
    uint16_t readBytes = 0;
    while(readBytes < length)
    {
      uint16_t currentOffset = (offset + readBytes);
      uint16_t blockAddr = currentOffset / 4;
      // bytes still to be read
      uint32_t remainingBytes = length - readBytes;
      // bytes to read in current block
      uint8_t bytesInBlock = 4 - (currentOffset%4);
      bytesInBlock = bytesInBlock > remainingBytes ? remainingBytes : bytesInBlock;
      err = rfalSt25tbPollerReadBlock(blockAddr,(rfalSt25tbBlock*)rxBuf);
      if(err != ERR_NONE)
      {
        return NFCTAG_ERROR;
      }
      memcpy(buffer + readBytes, &rxBuf[currentOffset%4], bytesInBlock);
      readBytes += bytesInBlock;
    }
  } else if (Current->type == BSP_NFCTAG_NFCB) {
      uint8_t rxBuf[RFAL_ISODEP_DEFAULT_FSC + RFAL_ISODEP_PROLOGUE_SIZE];
      uint16_t rxBufLen = 0xF0;
      uint8_t err;
      // read bytes
      uint16_t rxLen = rxBufLen;

      uint16_t readBytes = 0;
      uint16_t currentOffset = offset;
      uint16_t currentLength = length;
      while (currentLength > 0)
      {
        t4tReadBinary[2] = (currentOffset) >> 8;
        t4tReadBinary[3] = (currentOffset) & 0xFF;
        t4tReadBinary[4] = (currentLength) > rxBufLen ? rxBufLen : (currentLength);

        err = t4tSendCommand(t4tReadBinary, sizeof(t4tReadBinary), (rfalIsoDepBufFormat*)&rxBuf, &rxLen);
        if(rxLen > 2)
        {
          rxLen -= 2; // status bytes
          if(rxLen > currentLength)
            rxLen = currentLength;
          memcpy(buffer + readBytes,&((rfalIsoDepBufFormat*)rxBuf)->inf[0],rxLen);
        } else {
          rxLen = 0;
        }
        if(( err != ERR_NONE ) || (rxLen == 0 ))
        {
          return NFCTAG_ERROR;
        } else {
          currentOffset += rxLen;
          currentLength -= rxLen;
          readBytes += rxLen;
        }
      }
  }
  return NFCTAG_OK;
}

/* NFCB Tag write data method */
static uint8_t BSP_NFCTAG_WriteData_NfcB(uint8_t* buffer, uint32_t offset, uint32_t length)
{
    uint8_t rxBuf[0xFF];
    uint16_t rxLen = 0xF0;
    uint8_t status = 0xFF;
    uint16_t currentOffset = offset;
    uint16_t lastOffset = offset + length;
    uint16_t nbBytesToWrite = length;
    uint8_t cmd[256 + 5 + 10];
    uint8_t nbBytesWritten = 0;

    while (currentOffset < lastOffset)
    {
      switch( Current->type )
      {
        case BSP_NFCTAG_ST25TB:
        {
          /* Manage offset and length for block based memories */
          rfalSt25tbBlock block;
          uint8_t blockInternalOffset = currentOffset % 4;
          uint8_t blockInternalLength = 4 - (currentOffset % 4);
          blockInternalLength = blockInternalLength > nbBytesToWrite ? nbBytesToWrite : blockInternalLength;

          if((blockInternalOffset) || (blockInternalLength%4))
          {
            // 4 bytes block
            status = rfalSt25tbPollerReadBlock( currentOffset / 4, &block  );
            if(status != ERR_NONE)
            {
              return NFCTAG_ERROR;
            }

            memcpy(&block[blockInternalOffset],buffer,blockInternalLength);
            buffer += blockInternalLength;
            nbBytesWritten = blockInternalLength;

          } else {
            memcpy(&block, buffer, 4);
            buffer += 4;
            nbBytesWritten = 4;
          }

          status = rfalSt25tbPollerWriteBlock( currentOffset / 4, (const rfalSt25tbBlock *)&block  );

          if(status != ERR_NONE)
            return NFCTAG_ERROR;
          currentOffset +=nbBytesWritten;
        }
        break;
        case BSP_NFCTAG_NFCB:
            memcpy(cmd,t4tWriteData,sizeof(t4tWriteData));
            cmd[2] = offset >> 8;
            cmd[3] = offset & 0xFF;
            cmd[4] = length;
            memcpy(&cmd[5], buffer, length);
            status = t4tSendCommand(cmd, sizeof(t4tWriteData) + length, (rfalIsoDepBufFormat*)&rxBuf, &rxLen);
            currentOffset +=length;
        break;
        default:
        	break;
      }
    }

  if(status == ERR_NONE)
    return NFCTAG_OK;
  else
    return NFCTAG_ERROR;

}

/* NFCB Api */
static BSP_NFCTAG_Protocol_t apiNfcB = {
.activate = &BSP_NFCTAG_Activate_NfcB,
.read_data= &BSP_NFCTAG_ReadData_NfcB,
.write_data= &BSP_NFCTAG_WriteData_NfcB
};



/****************** NFCF *****************************/
/* NFCF Tag Select */
static uint8_t BSP_NFCTAG_Activate_NfcF(void)
{
  rfalFieldOff();                                                          /* Turns the Field On and starts GT timer */
  k_sleep(K_MSEC(500));
  rfalFieldOnAndStartGT();                                                          /* Turns the Field On and starts GT timer */
  rfalNfcfPollerInitialize( RFAL_BR_212 );

