poysh/hubble/src/st25r39/esp32/src/esp32_st25r.c
  uint8_t testBuf[32];
  // to do: add a check for NDEF support
  if(CurrentProtocol->read_data(testBuf,0,16) != ERR_NONE)
    Current->NdefSupport = 0;
  else
    Current->NdefSupport = 1;

  return NFCTAG_OK;
}

/* NFCF read data method */
static uint8_t BSP_NFCTAG_ReadData_NfcF(uint8_t* buffer, uint32_t offset, uint32_t length)
{
  uint8_t err;
  uint8_t txRxBuf[0xFF];
  uint16_t rxBufLen = 0xF0;
  // read bytes
  uint16_t rxLen = rxBufLen;
  uint16_t firstBlock =  (offset / 16);
  uint16_t lastBlock = (length + offset - 1) / 16;
  uint16_t blockNumber = lastBlock - firstBlock + 1;
  memset(txRxBuf,0,rxBufLen);

  /* To perform presence check, on this example a T3T Check/Read command is used */
  memcpy( &t3tCheckReq[1], Current->dev.nfcf.sensfRes.NFCID2, RFAL_NFCF_NFCID2_LEN );  /* Assign device's NFCID for Check command */
  t3tCheckReq[12] = blockNumber;
  memcpy(txRxBuf,t3tCheckReq,sizeof(t3tCheckReq));
  int i = 0;
  for(int blockId = firstBlock ; blockId <= lastBlock ; blockId++)
  {
    txRxBuf[13 + i*2] = 0x80;
    txRxBuf[14 + i*2] = blockId;
    i++;
  }
  err = rfalTransceiveBlockingTxRx(txRxBuf, sizeof(t3tCheckReq) + ((blockNumber-1) * 2), txRxBuf, rxBufLen, &rxLen, RFAL_TXRX_FLAGS_DEFAULT, rfalConvMsTo1fc(20) );
  if(err != ERR_NONE)
  {
    return NFCTAG_ERROR;
  }
  if((int)((int)rxLen - 13 - (int)(offset%16)) < (int)length)
  {
    return NFCTAG_RESPONSE_ERROR;
  }

  memcpy(buffer,&txRxBuf[13 + (offset%16)],length);
  return NFCTAG_OK;
}

/* NFCF write data method */
static uint8_t BSP_NFCTAG_WriteData_NfcF(uint8_t* buffer, uint32_t offset, uint32_t length)
{
  uint8_t err;
  uint8_t txRxBuf[0xFF];
  uint16_t rxBufLen = 0xF0;
  // read bytes
  uint16_t rxLen = rxBufLen;
  uint16_t firstBlock =  (offset / 16);
  uint16_t lastBlock = (length + offset - 1) / 16;

  memcpy( &t3tUpdateReq[1], Current->dev.nfcf.sensfRes.NFCID2, RFAL_NFCF_NFCID2_LEN );  /* Assign device's NFCID for Check command */

  int currentOffset = offset;
  for(int blockId = firstBlock ; blockId <= lastBlock ; blockId++)
  {
    int currentLength = 16 - currentOffset%16;
    currentLength = currentLength > length ? length : currentLength;

    t3tUpdateReq[14] = blockId;

    BSP_NFCTAG_ReadData_NfcF(&t3tUpdateReq[15],blockId*16,16);
    memcpy(&t3tUpdateReq[15] + currentOffset%16,buffer,currentLength);

    err = rfalTransceiveBlockingTxRx(t3tUpdateReq, sizeof(t3tUpdateReq) , txRxBuf, rxBufLen, &rxLen, RFAL_TXRX_FLAGS_DEFAULT, rfalConvMsTo1fc(20) );
    if(err != ERR_NONE)
    {
      return NFCTAG_ERROR;
    }
    currentOffset += currentLength;
    length -= currentLength;
    buffer += currentLength;
  }

  return NFCTAG_OK;
}

/* NFCF Api */
static BSP_NFCTAG_Protocol_t apiNfcF = {
.activate = &BSP_NFCTAG_Activate_NfcF,
.read_data = &BSP_NFCTAG_ReadData_NfcF,
.write_data = &BSP_NFCTAG_WriteData_NfcF
};


/****************** NFCV*****************************/
/* NFCV RX buffer length in bytes */
#define BSP_NFCTAG_NFCV_RXBUF_LENGTH 0xFF
/* T5 read single block command */
static uint8_t t5ExtReadSingleBlock[] =   {0x22, 0x30, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
static uint8_t vicExtReadSingleBlock[] =   {0x2A, 0x20, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
/* T5 read multiple block command */
static uint8_t t5ExtReadMultipleBlock[] = {0x22, 0x33, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
static uint8_t vicExtReadMultipleBlock[] = {0x2A, 0x23, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
/* T5 default block size */
static uint16_t t5BlockSize = 4;
static uint8_t isVicinity = 0;
static uint8_t t5MultipleBlockSupport = 0;

uint8_t BSP_NFCTAG_CheckVicinity()
{
  uint8_t* uid;
  if(Current == NULL)
  {
    return 0;
  }
  if(Current->type != BSP_NFCTAG_NFCV)
  {
    return 0;
  }
  uid = Current->dev.nfcv.InvRes.UID;
  if((uid[7] == 0xE0) && (uid[6] == 0x02) &&
      ((uid[5] == 0x44) || (uid[5] == 0x45) || (uid[5] == 0x46) ||
      (uid[5] == 0x2C) || (uid[5] == 0x2D) || (uid[5] == 0x2E) ||
      (uid[5] == 0x5C) || (uid[5] == 0x5D) || (uid[5] == 0x5E) ||
      (uid[5] == 0x4C) || (uid[5] == 0x4D) || (uid[5] == 0x4E)))
  {
    return 1;
  }
  return 0;
}

/* NFCV tag activation (set block size) */
static uint8_t BSP_NFCTAG_Activate_NfcV(void)
{
  if(Current->type == BSP_NFCTAG_NFCV)
  {
    uint8_t status;
    uint8_t rxBuf[16];

    isVicinity = BSP_NFCTAG_CheckVicinity();

    // let's consider it supports read multiple block
    t5MultipleBlockSupport = 1;

    // make sure the field is on
    rfalFieldOnAndStartGT();


    status = rfalNfcvPollerReadSingleBlock( 0x22, Current->dev.nfcv.InvRes.UID, 0,  rxBuf, 16, &t5BlockSize );

    // don't count the status byte
    t5BlockSize--;
    if(status == ERR_NONE)
    {
      Current->NdefSupport = 1;

    } else {
      // assume block size is 4
      t5BlockSize = 4;
      Current->NdefSupport = 0;
    }
    return NFCTAG_OK;
  } else {
    Current = NULL;
    return NFCTAG_ERROR;
  }
}



/* NFCV Tag read data */
static uint8_t BSP_NFCTAG_ReadData_NfcV(uint8_t* buffer, uint32_t offset, uint32_t length)
{

  int i = 0;
  uint16_t nbBytesRead = 0;
  uint8_t status = ERR_NONE;
  uint8_t  *txBuf;
  uint16_t txBufLen;
  uint8_t rxBuf[BSP_NFCTAG_NFCV_RXBUF_LENGTH];

  if((Current->type != BSP_NFCTAG_NFCV) ||
      (length == 0))
    return NFCTAG_ERROR;


  // make sure the field is on
  rfalFieldOnAndStartGT();

  // stick with readSingleBlock
  while(i < length)
  {
    uint32_t rxLen = length - i;
    if(rxLen > 0xF0)
      rxLen = 0xF0;

    // first try to use readMultipleBlock
    if(t5MultipleBlockSupport)
    {
      if(isVicinity)
      {
        // use extended command
        vicExtReadMultipleBlock[10] = ((offset + i)/t5BlockSize) & 0xFF;
        vicExtReadMultipleBlock[11] = ((offset + i)/t5BlockSize) >> 8;
        vicExtReadMultipleBlock[12] = ((rxLen - 1) /t5BlockSize) & 0xFF;
        txBuf = vicExtReadMultipleBlock;
        txBufLen = sizeof(vicExtReadMultipleBlock);
        memcpy(&txBuf[2],Current->dev.nfcv.InvRes.UID,8);
        nbBytesRead = rxLen;
        status = rfalTransceiveBlockingTxRx( vicExtReadMultipleBlock, txBufLen, rxBuf, BSP_NFCTAG_NFCV_RXBUF_LENGTH, &nbBytesRead, RFAL_TXRX_FLAGS_DEFAULT, rfalConvMsTo1fc(20) );
      } else if((offset + length) < 0xFF)
      {
        nbBytesRead = 0xF0;
        status = rfalNfcvPollerReadMultipleBlocks( 0x22, Current->dev.nfcv.InvRes.UID, (offset + i)/t5BlockSize, (rxLen - 1) / t5BlockSize, rxBuf, BSP_NFCTAG_NFCV_RXBUF_LENGTH , &nbBytesRead);
      } else {
        // use extended command
        t5ExtReadMultipleBlock[10] = ((offset + i)/t5BlockSize) & 0xFF;
        t5ExtReadMultipleBlock[11] = ((offset + i)/t5BlockSize) >> 8;
        t5ExtReadMultipleBlock[12] = ((rxLen - 1) /t5BlockSize) & 0xFF;
        t5ExtReadMultipleBlock[13] = ((rxLen - 1)/t5BlockSize) >> 8;
        txBuf = t5ExtReadMultipleBlock;
        txBufLen = sizeof(t5ExtReadMultipleBlock);
        memcpy(&txBuf[2],Current->dev.nfcv.InvRes.UID,8);
        nbBytesRead = rxLen;
        status = rfalTransceiveBlockingTxRx( t5ExtReadMultipleBlock, txBufLen, rxBuf, BSP_NFCTAG_NFCV_RXBUF_LENGTH, &nbBytesRead, RFAL_TXRX_FLAGS_DEFAULT, rfalConvMsTo1fc(20) );
      }
    }
    if ((status != ERR_NONE) || (!t5MultipleBlockSupport))
    {
      // looks like read multiple blocks failed!
      t5MultipleBlockSupport = 0;

