poysh/hubble/src/st25r39/esp32/src/esp32_st25r.c
      // try read single block
      if (isVicinity)
      {
        vicExtReadSingleBlock[10] = ((offset + i)/t5BlockSize) & 0xFF;
        vicExtReadSingleBlock[11] = ((offset + i)/t5BlockSize) >> 8;
        txBuf = vicExtReadSingleBlock;
        txBufLen = sizeof(vicExtReadSingleBlock);
        nbBytesRead = t5BlockSize;
        memcpy(&txBuf[2],Current->dev.nfcv.InvRes.UID,8);
        status = rfalTransceiveBlockingTxRx( vicExtReadSingleBlock, txBufLen, rxBuf, BSP_NFCTAG_NFCV_RXBUF_LENGTH, &nbBytesRead, RFAL_TXRX_FLAGS_DEFAULT, rfalConvMsTo1fc(20) );
      } else if (((offset + i)/t5BlockSize) < 0xFF)
      {
         nbBytesRead = t5BlockSize;
         status = rfalNfcvPollerReadSingleBlock( 0x22, Current->dev.nfcv.InvRes.UID, (offset + i)/t5BlockSize,  rxBuf, BSP_NFCTAG_NFCV_RXBUF_LENGTH, &nbBytesRead );
      } else {
        t5ExtReadSingleBlock[10] = ((offset + i)/t5BlockSize) & 0xFF;
        t5ExtReadSingleBlock[11] = ((offset + i)/t5BlockSize) >> 8;
        txBuf = t5ExtReadSingleBlock;
        txBufLen = sizeof(t5ExtReadSingleBlock);
        nbBytesRead = t5BlockSize;
        memcpy(&txBuf[2],Current->dev.nfcv.InvRes.UID,8);
        status = rfalTransceiveBlockingTxRx( t5ExtReadSingleBlock, txBufLen, rxBuf, BSP_NFCTAG_NFCV_RXBUF_LENGTH, &nbBytesRead, RFAL_TXRX_FLAGS_DEFAULT, rfalConvMsTo1fc(20) );
      }
    }
    if ((status != ERR_NONE) || (nbBytesRead < (1 + (offset+i)%4)))
      return NFCTAG_ERROR;
   // remove status byte & first bytes if offset is not aligned
   nbBytesRead--;
   nbBytesRead -= (offset+i)%t5BlockSize;
   memcpy(buffer+i,&rxBuf[1 + ((offset+i)%t5BlockSize)],(nbBytesRead > length) ? length : nbBytesRead);
   i += nbBytesRead;
  }
  return NFCTAG_OK;
}

/* NFCV Tag write data */
static uint8_t BSP_NFCTAG_WriteData_NfcV(uint8_t* buffer, uint32_t offset, uint32_t length)
{
  uint32_t currentOffset = offset;
  uint32_t lastOffset = offset + length;
  uint8_t status;
  uint8_t block[16] = {0};
  uint16_t nbBytesRead = 0;
  uint16_t nbBytesToWrite = length;
  uint8_t nbBytesWritten = 0;

  while(currentOffset < lastOffset)
  {
    uint8_t blockInternalOffset = currentOffset % t5BlockSize;
    uint8_t blockInternalLength = t5BlockSize - (currentOffset % t5BlockSize);
    blockInternalLength = blockInternalLength > nbBytesToWrite ? nbBytesToWrite : blockInternalLength;

    if((blockInternalOffset) || (blockInternalLength%4))
    {
      status = rfalNfcvPollerReadSingleBlock( 0x22, Current->dev.nfcv.InvRes.UID, currentOffset/t5BlockSize,  block, 10, &nbBytesRead );
      if((status != ERR_NONE) || (block[0] != 0))
      {
        return NFCTAG_ERROR;
      }
      // remove first byte (tag status)
      memmove(block, &block[1], t5BlockSize);
      memcpy(&block[blockInternalOffset],buffer,blockInternalLength);
      buffer += blockInternalLength;
      nbBytesWritten = blockInternalLength;

    } else {
      memcpy(block, buffer, t5BlockSize);
      buffer += t5BlockSize;
      nbBytesWritten = t5BlockSize;
    }

    status = rfalNfcvPollerWriteSingleBlock( 0x22, Current->dev.nfcv.InvRes.UID, currentOffset / t5BlockSize, block, t5BlockSize );
    if(status != ERR_NONE)
    {
      return NFCTAG_ERROR;
    }
    currentOffset +=nbBytesWritten;
  }
  return NFCTAG_OK;
}

/* NFCV Api */
static BSP_NFCTAG_Protocol_t apiNfcV = {
.activate = &BSP_NFCTAG_Activate_NfcV,
.read_data= &BSP_NFCTAG_ReadData_NfcV,
.write_data = &BSP_NFCTAG_WriteData_NfcV
};

/******************************* Common API ********************************/
/**
  * @brief Generic Tag activation method
  *        Perform required actions depending on the current selected protocol.
  *        E.g.: Run select command, get block size,...
  * @param device the device to run activation on.
  * @returns status, 0 is a success, other values are errors.
  */
uint8_t BSP_NFCTAG_Activate(BSP_NFCTAG_Device_t * device)
{
  // reset Current tag under operation
  Current = NULL;
  // select the protocol
  switch (device->type)
  {
    case BSP_NFCTAG_NFCA:
      CurrentProtocol = &apiNfcA;
    break;
    case BSP_NFCTAG_NFCB:
    case BSP_NFCTAG_ST25TB:
      CurrentProtocol = &apiNfcB;
    break;
    case BSP_NFCTAG_NFCF:
      CurrentProtocol = &apiNfcF;
    break;
    case BSP_NFCTAG_NFCV:
      CurrentProtocol = &apiNfcV;
    break;
    default:
      CurrentProtocol = NULL;
      return NFCTAG_ERROR;
  }

  // set current operating tag with provided instance
  Current = device;

  if((CurrentProtocol != NULL) && (CurrentProtocol->activate!=NULL))
    return CurrentProtocol->activate();
  else
    return NFCTAG_ERROR;

}

/**
  * @brief Generic Tag read method
  *        Perform required actions to read data from the previously activated tag.
  * @param buffer Pointer on the buffer to be used to store the read data.
  * @param offset Address of the tag to be read.
  * @param length Number of bytes to read.
  * @returns status, 0 is a success, other values are errors.
  */
uint8_t BSP_NFCTAG_ReadData(uint8_t* buffer, uint32_t offset, uint32_t length)
{
  if((CurrentProtocol != NULL) && (CurrentProtocol->read_data!=NULL))
    return CurrentProtocol->read_data(buffer,offset,length);
  else
    return NFCTAG_ERROR;
}


/**
  * @brief Generic Tag write method
  *        Perform required actions to write data to the previously activated tag.
  * @param buffer Pointer on the buffer with data to write.
  * @param offset Address of the tag to be written.
  * @param length Number of bytes to write.
  * @returns status, 0 is a success, other values are errors.
  */
uint8_t BSP_NFCTAG_WriteData(uint8_t* buffer, uint32_t offset, uint32_t length)
{
  if((CurrentProtocol != NULL) && (CurrentProtocol->write_data!=NULL))
    return CurrentProtocol->write_data(buffer,offset,length);
  else
    return NFCTAG_ERROR;
}

/**
  * @brief Generic method to get the tag size, in bytes
  *        Perform required actions to get tag size of the previously activated tag.
  * @returns size of the tag in bytes
  * @warning Not yest implemented - always return 512
  * @todo implement for each tag type...
  */
uint16_t BSP_NFCTAG_GetByteSize(void)
{
  return 512;
}
